[
  {
    "cat": "قانون ملكي",
    "idea": "⚠️ أمر الإخلاص: يمنع منعاً باتاً الانضمام لنقابتين في آن واحد؛ الولاء لنقابة واحدة فقط أو مواجهة الطرد النهائي من النظام."
  },
  {
    "cat": "إداري",
    "idea": "نظام طرد تلقائي عند استخدام الكلمات المحظورة أو السب."
  },
  {
    "cat": "إداري",
    "idea": "نظام تحذيرات متطور (3 تحذيرات تؤدي لحظر العضو تلقائياً)."
  },
  {
    "cat": "إداري",
    "idea": "قفل الجروب وفتحه بجدول زمني محدد (وضع السكون الملكي)."
  },
  {
    "cat": "إداري",
    "idea": "منع الروابط والمنشورات الإعلانية ومنع التوجيه من قنوات أخرى."
  },
  {
    "cat": "إداري",
    "idea": "الترحيب بالأعضاء الجدد برسالة وصورة احترافية تحمل اسم العضو."
  },
  {
    "cat": "إداري",
    "idea": "نظام كشف الحسابات الوهمية والمنتحلة لأسماء الإدارة."
  },
  {
    "cat": "إداري",
    "idea": "سجل مراقبة كامل (Log) لحفظ كل التحركات داخل الجروب."
  },
  {
    "cat": "إداري",
    "idea": "ميزة 'الوضع الهادئ' لمنع إرسال الميديا (صور/ملصقات) في أوقات الزحام."
  },
  {
    "cat": "ترفيه",
    "idea": "لعبة 'غارة الزعيم' (Boss Raid) حيث يتعاون الجميع لهزيمة وحش عملاق."
  },
  {
    "cat": "ترفيه",
    "idea": "نظام 'استدعاء الظلال' للحصول على مرافق شخصي بليفل محدد."
  },
  {
    "cat": "ترفيه",
    "idea": "لعبة 'صيد الكنوز' تظهر بشكل عشوائي للأعضاء المتفاعلين."
  },
  {
    "cat": "ترفيه",
    "idea": "تحديات سرعة الكتابة والبديهة بين أعضاء النقابة."
  },
  {
    "cat": "ترفيه",
    "idea": "نظام 'المبارزة الملكية' للمراهنة بنقاط المانا بين شخصين."
  },
  {
    "cat": "ترفيه",
    "idea": "لعبة السجن (يمكن للمشرف سجن عضو ولا يخرج إلا بكفالة مانا)."
  },
  {
    "cat": "نظام",
    "idea": "نظام ليفل (Level) يرتفع تلقائياً بناءً على عدد رسائل العضو."
  },
  {
    "cat": "نظام",
    "idea": "توزيع رتب تلقائية (S, A, B, C, D) تعكس قوة العضو في الشات."
  },
  {
    "cat": "نظام",
    "idea": "بطاقة هوية (ID Card) لكل صياد تظهر ليفله ورتبته وانجازاته."
  },
  {
    "cat": "نظام",
    "idea": "عملة 'المانا' الرسمية للبوت التي تستخدم في الشراء واللعب."
  },
  {
    "cat": "نظام",
    "idea": "المتجر الملكي لشراء ألقاب مميزة تظهر بجانب اسم العضو."
  },
  {
    "cat": "نظام",
    "idea": "بنك النقابة لحفظ النقاط وتحويلها بين الأعضاء المخلصين."
  },
  {
    "cat": "ذكاء",
    "idea": "ردود ذكية ومخصصة تحاكي أسلوب سونغ جين وو في الكلام."
  },
  {
    "cat": "ذكاء",
    "idea": "ميزة تلخيص الرسائل الفائتة للعضو الغائب باستخدام AI."
  },
  {
    "cat": "ذكاء",
    "idea": "تحويل أي نص إلى بصمة صوتية فخمة أو مضحكة."
  },
  {
    "cat": "ذكاء",
    "idea": "تحويل الصور إلى ملصقات (Stickers) فورية وبجودة عالية."
  },
  {
    "cat": "ذكاء",
    "idea": "نظام البحث الذكي عن الأفلام، الأنمي، والأغاني من داخل الشات."
  },
  {
    "cat": "أدوات",
    "idea": "تحميل فيديوهات تيك توك وإنستغرام بدون علامة مائية."
  },
  {
    "cat": "أدوات",
    "idea": "نظام مواقيت الصلاة والأذكار والقرآن الكريم."
  },
  {
    "cat": "أدوات",
    "idea": "ميزة اختصار الروابط الطويلة وتوليد أكواد QR."
  },
  {
    "cat": "أدوات",
    "idea": "اختبار سرعة الإنترنت ومعرفة حالة السيرفرات."
  },
  {
    "cat": "نظام",
    "idea": "مهام يومية (Daily Quests) تعطي مكافآت مانا عند إتمامها."
  },
  {
    "cat": "حماية",
    "idea": "درع النظام ضد الفيروسات والروابط التي تسبب اختراق الحسابات."
  },
  {
    "cat": "ترفيه",
    "idea": "لعبة 'الاعترافات' لإرسال رسائل مجهولة المصدر داخل الجروب."
  }
]
